app/controllers/factories_controller.rb

INSERT INTO `factories` (`mobile`, `email`, `encrypted_password`, `name`, `tel`, `created_at`, `updated_at`) VALUES ('007', '123@qq.com', '1111111', 'user2', '5212', '2017-04-09 14:57:57', '2017-04-09 14:57:57')
---
  def create
    @factory = Factory.new(factory_create_params)

    respond_to do |format|
      if @factory.save

SELECT COUNT(*) FROM `factories` WHERE (mobile = '007' and encrypted_password = '1111111')
---
  def login
    @factory = Factory.where(["mobile = ? and encrypted_password = ?", params[:mobile], params[:encrypted_password]])

    respond_to do |format|
      if @factory.empty?

SELECT `factories`.* FROM `factories` WHERE (mobile = 186 and encrypted_password = '1111111')
SELECT COUNT(*) FROM `factories` WHERE (mobile = '186' and encrypted_password = '111111')
UPDATE `factories` SET `encrypted_password` = '1234562', `updated_at` = '2017-04-14 14:09:39' WHERE `factories`.`id` = 2
---
  def reset
    # 测试时直接加个的mobile,测完要注释掉,要取session的mobile
    mobile = 186
    #mobile = session['mobile']
    @factory = Factory.where(["mobile = ? and encrypted_password = ?",mobile, params[:old_encrypted_password]])
    respond_to do |format|
      if @factory.empty?
        format.json { render :json => {:data => "Reset failed"}.to_json }
      else
        first = @factory[0]
        first.update_attributes(:encrypted_password => params[:new_encrypted_password])